<?php


/*
|--------------------------------------------------------------------------
| Authentication Language Lines
|--------------------------------------------------------------------------
*/

return 
    [
        "failed"            =>"البيانات المُدخلة غير صحيحة",
        "throttle"          =>"أجريت عدد محاولات أكثر من اللازم، يرجى المحاولة لاحقًا",
        "Login"             =>"دخول",
        "Logout"            =>"خروج",
        "Register"          =>"تسجيل",
        "E-Mail Address"    =>"عنوان البريد الإلكتروني",
        "Password"          =>"كلمة المرور",
        "Remember Me"       =>"تذكر بيانات الدخول",
        "Forgot Password"   =>"هل نسيت كلمة المرور؟",
        "Name"              =>"اسم المستخدم",
        "Confirm Password"  =>"تأكيد كلمة المرور",
        "Reset Password"    =>"إعادة تعيين كلمة المرور",
        'Send Password'     =>"أرسل رابط استعادة كلمة المرور",
        'Verify Email'      =>"التحقق من البريد الإلكتروني",
        'link been sent'    =>"تم إرسال رابط التحقق إلى عنوان بريدك الإلكتروني.",
        'Before proceeding' =>"قبل المتابعة، يرجى التحقق من بريدك الالكتروني للحصول على رابط التحقق.",
        'did not receive'   =>"إذا لم تستلم البريد الإلكتروني",
        'click here'        =>"فانقر هنا لإعادة الطلب",

    ];
?>